{"sections":{"page-careers":{"type":"page-careers","blocks":{"3cb219c3-d1c9-4508-be89-881f303dcf6a":{"type":"image","settings":{"title":"Sales and Logistics Administrator","job_description":"<p>We are seeking a Sales and Logistics Administrator to support our team to help us grow our online shop and further our business footprint around the world.<br\/><\/p><p><strong>Job Responsibilities<\/strong><\/p><p><br\/>1. Calculating shipping costs<br\/>2. Updating weekly shipment\/payment status<br\/>3. Dealing with shipment and Coordinating with forwarders<br\/>4. Creating quotations<br\/>5. Processing orders in ERP<br\/>6. Informing customers of dispatch timeline and dealing with shipping delays<br\/>7. Oversight of production and inventory levels<br\/>8. Assisting sales team in activities and processes<br\/>9. Accounts Receivable Collections<br\/>10. Maintaining and updating sales data<\/p><p><\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"","link_104":"https:\/\/www.104.com.tw\/job\/7j3eo?jobsource=n_my104_search","experience":"3 Years +"}},"a4ffed30-70ac-4119-af7f-c9ee83146bea":{"type":"image","settings":{"title":"Website Assistant Developer \/ 網頁開發人員","job_description":"<p>*Near-fluent English speaker<br\/>*1+ years experience in web development<br\/>*Deep appreciation for, and understanding of good web design. You don't need to be a designer, but you should \"<strong>get it<\/strong>.\"<br\/>*Expertise in HTML\/CSS\/JS\/AJAX\/Ruby\/PHP<br\/>*Knowledge of Bootstrap framework<br\/>*Understanding of databases MySQL \/ Postgres<br\/>*Well versed in RWD techniques and mobile performance<br\/>*Comfortable with building front-end templates using JSON APIs<br\/>*Take pride in clean, readable code<br\/>*Understanding of best practices for SEO optimized website<\/p><p><strong>Pluses<\/strong><br\/>*Have Shopify\/Liquid\/Ruby development experience<br\/>*Desire to learn (curiosity)<br\/>*Passion for all things web<br\/>*Willingness to do things the right way (especially, late in the game when it's hard)<br\/>*Easy and enjoyable to work with<br\/>*Have high attention to detail<br\/>*Communicate well in writing<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"45,000 ~ 65,000","link_104":"https:\/\/www.104.com.tw\/job\/7f6a2?jobsource=jolist_c_relevance","experience":"2"}},"c63dae8d-e821-43e5-b711-68218cca52df":{"type":"image","settings":{"title":"Ruby on Rails Developer \/ RoR 開發人員","job_description":"<p>*Good English level<br\/>*1+ years experience in web development<br\/>*Have Shopify\/Liquid development experience<br\/>*Deep appreciation for, and understanding of good web design. You don't need to be a designer, but you should \"get it.\"<br\/>*Expertise in HTML\/CSS\/Sass\/JS\/AJAX\/RoR<br\/>*Knowledge of Bootstrap framework<br\/>*Understanding of databases MySQL \/ Postgres<br\/>*Well versed in RWD techniques and mobile performance<br\/>*Comfortable with building front-end templates using JSON APIs<br\/>*Take pride in clean, readable code<br\/>*Understanding of best practices for SEO optimized website<br\/><br\/><strong>Pluses<\/strong><br\/>*Desire to learn (curiosity)<br\/>*Passion for all things web<br\/>*Willingness to do things the right way (especially, late in the game when it's hard)<br\/>*Easy and enjoyable to work with<br\/>*Have high attention to detail<br\/>*Communicate well in writing<\/p><p><strong>Knowledge of:<\/strong><\/p><p>AJAX, Java, PHP, MS SQL, MySQL HTML, JavaScript, jQuery, CSS, SASS.<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"43,000 ~ 48,000","link_104":"https:\/\/www.104.com.tw\/job\/4q8r4?jobsource=jolist_c_relevance","experience":"2"}},"7711201c-4f49-4f49-8f0a-1574c96807f0":{"type":"image","settings":{"title":"Growth Marketing Specialist \/ 成長行銷","job_description":"<p><strong>Responsibilities include:<\/strong><br\/><br\/>- Ad Strategy: Identify ad networks (SEM, Social, and display ads) and implement a strategy that provides visibility in different areas of the funnel and customer journey.<br\/><br\/>- Build consumer acquisition and retention hypotheses, test them and iterate to optimize performance across the funnel (traffic, consideration, conversion, retention, revenue, and profitability) and channel (email, search engine, referral, etc)<br\/><br\/>- Develop and execute A\/B tests with accurate analysis and reporting<br\/><br\/>- Analyze data on marketing campaign performance and return on investment per channel; report on your findings, identify opportunities for improvement, and systemize the learnings<br\/><br\/>- Use marketing automation tools and collaborate with product managers, content managers, UI\/UX designers, and other resources you can get to maximize the conversion.<br\/><br\/><strong>What Makes You Outstanding:<\/strong><br\/><br\/>- Storytelling<br\/>- Branding and Positioning<br\/>- Funnels \/ Customer Journey<br\/>- Buyer Personas Analysis<br\/>- Content for Each Funnel Stage<br\/>- Strong Communication<br\/>- Strong Organization<br\/>- Content Curation<br\/>- Creativity<br\/>- Copywriting<br\/>- Research<br\/>- Excellent English writing skills<br\/>- Understanding of Brand Voice<br\/>- Data-Based Decision-Making<br\/>- Experience with Running Scientific Experiments<br\/>- Strong Presentation Skills<\/p><p>- Master's Degree in marketing, communications, digital marketing, or related<br\/>- 2-3 years of relevant work experience in digital marketing, e-commerce, preferably in a tech environment<br\/>- Ability to work in a fast-paced environment with multiple stakeholders<br\/>- Demonstrated ability to organize, prioritize, and multitask under tight deadlines<br\/>- Detail-oriented individual who takes initiative to define and improve processes<br\/>- Working knowledge of Hubspot, WordPress & Excel<br\/>- Experience with marketing reporting<br\/>- Native or near-native English skills<br\/><br\/><strong>Must have:<\/strong><br\/>- Understanding of Google Analytics \/ Tag Manager \/ Search Console<br\/>- Klaviyo, PostScript<br\/>- Google Sheets (excel)<br\/>- Facebook Business \/ Analytics \/ Ads Manager<br\/>- Audience Creation (Lookalikes, Geotargeting)<br\/>- Budgeting<br\/>- Reporting<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"48,000 ~ 55,000","link_104":"https:\/\/www.104.com.tw\/job\/78ajz?jobsource=jolist_c_relevance","experience":"2+"}},"3c4e3413-8d6d-4ba1-bf2d-be7bbce41133":{"type":"image","settings":{"title":"Backend Engineer 後端工程師","job_description":"<p><strong>【主要工作內容】<\/strong><br\/>1. 伺服器建置、佈署及維護<br\/>2. 資料庫設計與維護<br\/>3. RESTful API設計與維護<br\/><br\/><strong>【徵求條件】<\/strong><br\/>1. 熟悉PostgreSQL<br\/>2. 熟悉Ubuntu、Debian環境<br\/>3. 熟悉網路通訊協定，如Websocket、HTTP等<br\/>4. 熟悉Python、CherryPy<br\/>5. 熟悉AWS EC2、CodeCommit<br\/>6. 熟悉Git<\/p>","location":"Neihu, Taipei, Taiwan","salary":"","link_104":"https:\/\/www.104.com.tw\/job\/7ejhh?jobsource=jolist_c_relevance","experience":"3+"}},"13ef0ff2-9ac9-4c6c-b8a2-2c184371dd4e":{"type":"image","settings":{"title":"Full-time English Copywriter","job_description":"<p><strong>·Objectives of this Role<\/strong><br\/>- Thrive in a fast-paced, collaborative environment with a high-volume workload often requiring short turnaround times<br\/>- Continually raise the bar on creativity, writing fresh copy that connects with the desired audience and drives action<br\/>- Comfortably vary voice, style, and other characteristics demanded by the industry, company, or target audience at hand<br\/>- Maintain up-to-date knowledge of communication and client-related industry trends<br\/>- Stay updated on appropriate style guidelines and brand voice for consistency in messaging<\/p><p><br\/><strong>Daily and Monthly Responsibilities<\/strong><br\/>- Interpret creative briefs to develop and produce creative concepts through execution on assigned brands<br\/>- Research and understand the client's needs and target audiences, through online searches, reviews of existing research, interviews with subject matter experts, and in-person meetings<br\/>- Write original copy and edit content for a range of corporate marketing and communications materials<br\/>- Collaborate with a team of account managers and creative staff from concept development to delivery of the final product<br\/>- Present copy concepts and final deliverables to the internal team, and to client representative as needed, and participate in client pitches on occasion<br\/>- Revise copy based on internal and client feedback\/direction<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"50,000 ~ 60,000","link_104":"https:\/\/www.104.com.tw\/job\/7f2qh?jobsource=jolist_c_relevance","experience":"2+"}},"86381242-51f5-48c0-92ff-c983a7310247":{"type":"image","settings":{"title":"UI\/UX Designer","job_description":"<p><strong>Responsibilities<\/strong><br\/>1. User Interface Design<br\/>2. User Experience Design<br\/>3. Make sure the finished product meets the design standards<br\/>4. Design proposal, case opening and closing<br\/>5. Data collection, analysis and report writing<br\/><br\/>6 The product includes website, software and equipment operation, etc.<br\/>7. Teamwork includes marketing, business, sales, engineering and customers<\/p>","location":"Neihu, Taipei Taiwan","salary":"","link_104":"https:\/\/www.104.com.tw\/job\/7gewm?jobsource=jolist_c_relevance","experience":"6+"}},"410a193d-211e-4ab3-91e3-ba2b0ef3a1c0":{"type":"image","disabled":true,"settings":{"title":"Project Manager 專案經理","job_description":"<p>1. Monitoring of various operational projects including technical development, vendor and customer partnerships, and implementation of new system\/processes<br\/>2. Optimizing our business operations based on internal data. You will identify operational weaknesses and help improve or innovate new processes<br\/>3. Collaborate with teams across product, engineer, and external partnerships to ensure that insights inform broader strategic initiatives<br\/>4. Develop a detailed project plan to track progress using a project management software<br\/>5. Perform risk management to minimize project risks and optimization methods<br\/>6. Establish and maintain relationships with third parties\/vendors<br\/>7. Create and maintain comprehensive project documentation<br\/>8. Ensure that all projects are delivered on time, within the scope, and within budget<br\/>9. Developing project scopes and objectives, involving all relevant stakeholders and ensuring technical feasibility<\/p>","location":"","salary":"70,000 ~ 75,000","link_104":"https:\/\/www.104.com.tw\/job\/7dj29?jobsource=jolist_c_relevance","experience":"5+"}},"aa9f50a8-e098-4402-8f59-31dc561af3d5":{"type":"image","settings":{"title":"Accounting Intern 財務會計實習生","job_description":"<p>1. Answer the phone<br\/>2. ERP basic data maintenance<br\/>3. Customer order filing<br\/>4. FedEx shipment details check<br\/>5. Download the transaction details from the e-commerce<br\/>6. Other tasks assigned by supervisor<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"168 ~ 250 per hour","link_104":"https:\/\/www.104.com.tw\/job\/7i1nv?jobsource=jolist_c_relevance","experience":""}},"00ed2e9f-baa6-4f23-84a2-9a867ea95e3f":{"type":"image","settings":{"title":"Social Media Assistant","job_description":"<p>The social media assistant is responsible for brainstorming campaigns, creating social media posts, and analyzing analytics.<br\/><br\/>To be successful as a social media assistant, you must have excellent time management skills. A good social media assistant is eager to keep abreast of industry innovations and new software.<br\/><strong>Responsibilities:<\/strong><br\/>1. Brainstorm campaigns<br\/>2. Create social media posts<br\/>3. Use analytics tools to gauge the success of campaigns<br\/>4. Research industry innovations and tools<br\/>5. Update posts to include relevant keywords for search engine optimization<br\/>6. Prepare reports on campaigns based on analytics<br\/><\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"48,000 ~ 50,000","link_104":"https:\/\/www.104.com.tw\/job\/7i3te?jobsource=jolist_c_relevance","experience":"1"}},"f2a5e1a0-7bdc-4867-9e40-57758a7d8c12":{"type":"image","settings":{"title":"Test Engineer Assistant","job_description":"<p><strong>Responsibilities<\/strong><br\/><br\/>1. Ensuring the mixing and the filling of the resin bottles<br\/>2. Recording the resin production outcomes (storage, quality control)<br\/>3. Ensuring all tests and procedures meet company and industry standards.<br\/>4. Testing the printers and resins and preparing test reports for management.<br\/><\/p><p><strong>Qualifications <\/strong><br\/><br\/>*Technical background<br\/>*Be able to keep a clean and safe environment<br\/>*Autonomous<br\/>*Ability to troubleshoot and think out of the box.<\/p>","location":"Neihu, Taipei, Taiwan","salary":"32,000 ~ 35,000","link_104":"https:\/\/www.104.com.tw\/job\/7i3tt?jobsource=jolist_c_relevance","experience":"1+"}},"0f2c657f-61f3-4e60-b935-f2f1d6fa56c7":{"type":"image","settings":{"title":"Customer Technical Support Agent","job_description":"<p><strong>Responsibilities<\/strong><br\/><br\/>1. Complete detailed reports listing requests for technical assistance, steps taken to resolve them, and the specific dates\/individuals involved<br\/>2. Act as the initial point of contact for customers\/users reaching via various channels such as social media, forums, etc with L1 requests for 3D Printers, cleaning and curing units, resins and software related concerns<br\/>3. Assist management in creating and planning training materials pertaining to all our products troubleshooting and usage<br\/>4. Organize and file documentation pertaining to warranties and instructional guides for 3D Printers and other related hardware<br\/>5. Maintain a working log detailing, nature of issues and best practices to resolve them<br\/>6. Attend meetings with clients to analyze, troubleshoot and diagnose hardware\/software problems<br\/>7. Actively log and update management of potential issues that could cause an undesirable user experience<\/p><p><\/p><p><strong>Qualifications<\/strong><br\/><br\/>*A bachelor's degree in computer science, electrical engineer or related technology field is preferred<br\/>*1-2 years of relevant experience in a customer focused position involving technical knowledge of a company's products and services<br\/>*Professional written and interpersonal skills are essential when communicating with customers and clients<br\/>*Ability to prioritize and manage several milestones and projects efficiently<br\/>*Accept constructive criticism and customer feedback regarding their experience with 3D Printing software<br\/>*Comfortable working in and assisting others through company help desk software, with remote access desktop programs<br\/>*Time-management skills and the ability to establish reasonable and attainable deadlines for resolution<\/p>","location":"Neihu Rd. Taipei, Taiwan","salary":"48,000 ~ 50,000","link_104":"https:\/\/www.104.com.tw\/job\/7i3u6?jobsource=jolist_c_relevance","experience":"1+"}}},"block_order":["3cb219c3-d1c9-4508-be89-881f303dcf6a","a4ffed30-70ac-4119-af7f-c9ee83146bea","c63dae8d-e821-43e5-b711-68218cca52df","7711201c-4f49-4f49-8f0a-1574c96807f0","3c4e3413-8d6d-4ba1-bf2d-be7bbce41133","13ef0ff2-9ac9-4c6c-b8a2-2c184371dd4e","86381242-51f5-48c0-92ff-c983a7310247","410a193d-211e-4ab3-91e3-ba2b0ef3a1c0","aa9f50a8-e098-4402-8f59-31dc561af3d5","00ed2e9f-baa6-4f23-84a2-9a867ea95e3f","f2a5e1a0-7bdc-4867-9e40-57758a7d8c12","0f2c657f-61f3-4e60-b935-f2f1d6fa56c7"],"settings":{"section_title":"Available Positions"}}},"order":["page-careers"]}